using StructuralIdentifiability

C = ones(4,4) 

ode = @ODEmodel(
    s1'(t) = -s1(t)* α * ( C[1, 1] * i1(t) + C[1, 2] * i2(t) + C[1, 3] * i3(t) + C[1, 4] * i4(t) ),
    i1'(t) =  s1(t) * α * ( C[1, 1] * i1(t) + C[1, 2] * i2(t) + C[1, 3] * i3(t) + C[1, 4] * i4(t) ) - ((λ1*γ1)/(λ1+γ1)) * i1(t)  - γ1*i1(t), 
    d1'(t) =  i1(t) * γ1 - d1(t) * (λ1 + δ1),
    t1'(t) =  δ1 * d1(t) - (σ1 + τ1) * t1(t),  
    h1'(t) = ((λ1*γ1)/(λ1+γ1)) * i1(t) + d1(t) * λ1 + t1(t) * σ1,      
    e1'(t) = t1(t) * τ1,   
    
    s2'(t) = -s2(t)* α * ( C[2, 1] * i1(t) + C[2, 2] * i2(t) + C[2, 3] * i3(t) + C[2, 4] * i4(t) ),
    i2'(t) =  s2(t) * α * ( C[2, 1] * i1(t) + C[2, 2] * i2(t) + C[2, 3] * i3(t) + C[2, 4] * i4(t) ) - ((λ2*γ2)/(λ2+γ2)) * i2(t)  - γ2*i2(t), 
    d2'(t) =  i2(t) * γ2 - d2(t) * (λ2 + δ2),
    t2'(t) =  δ2 * d2(t) - (σ2 + τ2) * t2(t),  
    h2'(t) = ((λ2*γ2)/(λ2+γ2)) * i2(t) + d2(t) * λ2 + t2(t) * σ2,      
    e2'(t) = t2(t) * τ2,    

    s3'(t) = -s3(t)* α * ( C[3, 1] * i1(t) + C[3, 2] * i2(t) + C[3, 3] * i3(t) + C[3, 4] * i4(t) ),
    i3'(t) =  s3(t) * α * ( C[3, 1] * i1(t) + C[3, 2] * i2(t) + C[3, 3] * i3(t) + C[3, 4] * i4(t) ) - ((λ3*γ3)/(λ3+γ3)) * i3(t)  - γ3*i3(t), 
    d3'(t) =  i3(t) * γ3 - d3(t) * (λ3 + δ3),
    t3'(t) =  δ3 * d3(t) - (σ3 + τ3) * t3(t),  
    h3'(t) = ((λ3*γ3)/(λ3+γ3)) * i3(t) + d3(t) * λ3 + t3(t) * σ3,      
    e3'(t) = t3(t) * τ3,    

    s4'(t) = -s4(t)* α * ( C[4, 1] * i1(t) + C[4, 2] * i2(t) + C[4, 3] * i3(t) + C[4, 4] * i4(t) ),
    i4'(t) =  s4(t) * α * ( C[4, 1] * i1(t) + C[4, 2] * i2(t) + C[4, 3] * i3(t) + C[4, 4] * i4(t) ) - ((λ4*γ4)/(λ4+γ4)) * i4(t)  - γ4*i4(t), 
    d4'(t) =  i4(t) * γ4 - d4(t) * (λ4 + δ4),
    t4'(t) =  δ4 * d4(t) - (σ4 + τ4) * t4(t),  
    h4'(t) = ((λ4*γ4)/(λ4+γ4)) * i4(t) + d4(t) * λ4 + t4(t) * σ4,      
    e4'(t) = t4(t) * τ4,

    y11(t) = s1(t),
    y12(t) = i1(t),
    y13(t) = d1(t),
    y14(t) = t1(t),
    y15(t) = h1(t),
    y16(t) = e1(t), 

    y21(t) = s2(t),
    y22(t) = i2(t),
    y23(t) = d2(t),
    y24(t) = t2(t),
    y25(t) = h2(t),
    y26(t) = e2(t),

    y31(t) = s3(t),
    y32(t) = i3(t),
    y33(t) = d3(t),
    y34(t) = t3(t),
    y35(t) = h3(t),
    y36(t) = e3(t), 
    
    y41(t) = s4(t),
    y42(t) = i4(t),
    y43(t) = d4(t),
    y44(t) = t4(t),
    y45(t) = h4(t),
    y46(t) = e4(t)
)

assess_identifiability(ode)